In [2]:
#Librerias para cargar al iniciar
import seaborn as sns
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
sns.set_theme(style="whitegrid")

### Cargar desde Google Drive

Ver Codigo
<!--
from google.colab import drive
drive.mount('/gdrive')

# Opción Google drive
# Usamos pandas para leer el csv en la ruta de nuestro drive
df1 = pd.read_csv('/gdrive/MyDrive/Monitoria IA/Practicas/Merge/Personas1.csv',    #Se ingresa la ruta completa a la ubicación del archivo de interés. El MyDrive de la ruta es tu "Mi Unidad", desde ahí vas ingresando a cada carpeta que tengas hasta llegar a tu archivo.
                na_values='?')              #Como el archivo contiene algunos caracteres ?, con este comando pandas los interpreta como nan (not a number).

df2 = pd.read_csv('/gdrive/MyDrive/Monitoria IA/Practicas/Merge/Personas2.csv',
                 na_values='?')
-->

### Cargar desde GitHub

Ver Codigo
<!--
# Opción GITHUB
# Opción GITHUB
df1 = pd.read_csv('https://raw.githubusercontent.com/armandoordonez/eda_couse/main/data/Personas1.csv',na_values='?')    
df2 = pd.read_csv('https://raw.githubusercontent.com/carlosjara/eda_icesi/main/Notebooks/Practicas_/data/Personas2.csv',na_values='?')

     
-->

### Cargar a Colab y usar en GoogleColab

Ver Codigo
<!--
Para subir el archivo a colab, damos click en el icono de carpeta que está en el menú del lado izquierdo y luego presionamos el icono del archivo con una flecha hacia arriba. Esto nos abrirá unan ventana con el explorador de archivos, donde podremos importar el dataset. Finalmente, solo se importa usando el nombre del csv y definiendo cuales valores interpretará pandas como nan.


#df1 = pd.read_csv('./Personas1.csv',na_values='?')
#df2 = pd.read_csv('./Personas2.csv', na_values='?')
-->

In [6]:
# Opción GITHUB
df1 = pd.read_csv('https://raw.githubusercontent.com/armandoordonez/eda_couse/main/data/Personas1.csv',na_values='?')              #Como el archivo contiene algunos caracteres ?, con este comando pandas los interpreta como nan (not a number).
df2 = pd.read_csv('https://raw.githubusercontent.com/carlosjara/eda_icesi/main/Notebooks/Practicas_/data/Personas2.csv',na_values='?')

In [7]:
df1.head()

  first_name   last_name    cc
0     Berget   Proughten  1495
1     Scotti  Yegorovnin   311
2    Clayton       Reide   914
3     Toddie     Haddick   671
4     Brynna    Ferrucci   692

In [8]:
df2.head()

      salary                city    cc
0   $5432.91  Sabon Gari-Nangere   611
1   $6581.31    San Rafael Abajo   561
2  $14405.46            Khvānsār    13
3  $27742.78              Cemara  1191
4  $88920.27          Diên Khánh   943

In [9]:
merged_df = pd.merge(df1,df2, on='cc')

In [10]:
merged_df.shape

(719, 5)

In [11]:
merged_df.head()

  first_name last_name    cc     salary          city
0    Clayton     Reide   914  $79239.05     Wierzbica
1     Toddie   Haddick   671  $75752.12        Heping
2     Brynna  Ferrucci   692  $53230.11       Thorold
3     Jarred     Spore   692  $53230.11       Thorold
4    Atlanta   Farnill  1207   $2875.12  Duwakkandung

##### Tipos de Merge

Los principales tipos de merge se pueden separar en 3:

Inner: Es el tipo de merge por defecto, solo toma los datos que coincidan en su columna de referencia para ambos dataset. (En el ejemplo fue la cc, si en alguno de los dos dataset no estaba la misma cc, no se agrega)

Left: Agrega los datos que estén en ambos dataset, pero también agrega los datos del dataset que pongamos primero en nuestra función merge. (En el ejemplo, el df1)

Right: Agrega los datos que estén en ambos dataset, pero también agrega los datos del dataset que pongamos primero en nuestra función merge. (En el ejemplo, el df1)
Para cambiar el tipo de Merge debemos añadir una instrucción a la función llamada "how":


```
pd.merge(df1,df2,on='cc',how="left")
```

tambien es posible hacer merge con mas de una columna

```
 pd.merge(df1,df2,on=['cc','city'])
```